from aiogram.types import KeyboardButton, InlineKeyboardButton, WebAppInfo
from aiogram.utils.keyboard import ReplyKeyboardBuilder, InlineKeyboardBuilder

user_keyboard_button = {
    'new_alarm': '⏰Изменить будильник⏰',
    'recomend': '💬Рекомендации💬',
    'sleep_time':'🕰Время сна🕰',
    'sleep_place':'🛏Место сна🛏',
    'training':'🏃Тренировки🏃',
    'food':'🍽Еда🍽',
    'gadgets':'💻Гаджеты💻'
    }

faqs = {"faq1": "🕰Время сна🕰", "faq2": "🛏Место сна🛏", "faq3": "🏃Тренировки🏃", "faq4": "🍽Еда🍽", "faq5":"💻Гаджеты💻"}
faq_answers = {"faq1" : "🕰Время сна🕰 \nДля повышения качества сна рекомендуется придерживаться регулярного режима: ежедневно, включая выходные, отправляться ко сну и пробуждаться в одно и то же время.",
               "faq2" : "🛏Место сна🛏 \nОбеспечение качественного сна требует наличия удобного спального места. В помещении должна поддерживаться полная темнота, минимальный уровень шума (около 30–40 дБА) и температура воздуха в пределах +19...+20 °C.",
               "faq3" : "🏃Тренировки🏃 \nРекомендуется регулярная физическая активность, исключающая интенсивные тренировки незадолго до отхода ко сну. Полезно осваивать релаксационные методики, такие как дыхательные упражнения, занятия йогой либо медитативные практики.",
               "faq4" : "🍽Еда🍽 \nОптимальная практика предполагает последний приём пищи не позднее двух часов до отхода ко сну для предотвращения желудочного дискомфорта. Вечером целесообразно ограничить употребление кофеинсодержащих напитков, табачных изделий и алкогольных продуктов.",
               "faq5" : "💻Гаджеты💻 \nИсключайте использование мобильных устройств, планшетных компьютеров и ноутбуков за один-два часа до сна. Излучаемый ими синий спектр света препятствует естественной секреции мелатонина, нарушая процесс подготовки организма ко сну и снижая его качество."}

def alarm_keyboard_maker():
    keyboard_builder = ReplyKeyboardBuilder()
    button1 = KeyboardButton(text=user_keyboard_button['new_alarm'])
    keyboard_builder.row(button1)
    return keyboard_builder.as_markup(resize_keyboard=True)

def menu_keyboard_maker():
    keyboard_builder = ReplyKeyboardBuilder()
    button1 = KeyboardButton(text=user_keyboard_button['new_alarm'])
    button2 = KeyboardButton(text=user_keyboard_button['recomend'])
    web_app_button = KeyboardButton(
        text="📋О боте📋",
        web_app=WebAppInfo(url="https://sleepingbot.bitrix24site.ru")
    )
    keyboard_builder.add(web_app_button)
    keyboard_builder.row(button1)
    keyboard_builder.row(button2)
    return keyboard_builder.as_markup(resize_keyboard=True)

def faq_keyboard_maker():
    builder = InlineKeyboardBuilder()
    for faq in faqs.keys():
        button = InlineKeyboardButton(text=faqs[faq], callback_data=faq)
        builder.row(button)
    return builder.as_markup(resize_keyboard=True, is_persistent=True)
